{
  "What is the least intelligent thing you've ever seen a tourist do?": "I spent a lot of time in the tourist areas of Niagara Falls.\n    There are three separate waterfalls. The largest is the Horseshoe Falls, pictured down below.\n    There is a huge park along the river, and it is freely accessible to anyone. \n    You can actually drive to within a few hundred meters/yards of the brink on the Canadian side (but it gets crowded).\n    Along most of the Canadian side of the river, there is only a stone fence, with a metal railing. \n    Here is a photo taken right at the edge of the larger Horseshoe Falls.",
    "What is the most intelligent thing you've ever seen a tourist do?": "I swear the following story is true…\n    I went on a guided 4 x 4 tour in some of the natural parks of Botswana, \n    Namibia and Zimbabwe with some other folks a while back. \n    Our guide was a pretty tough looking fellow who was very well versed in the natural world. \n    He was happy to point out the various flora and fauna that we passed as we drove through the parks and, \n    at one point, \n    were poled along the Okavango swamps in low canoes called mokoros.",
    "What people are living proof that size doesn't matter?": "Size does matter.\n    If someone tells you it’s an issue for them, it is. And this is an issue I hear about often.\n    I’m sure there are lots of interesting and even inspiring stories that relate to this question,\n    but I’m not going to tell you one.",
    "Who was the rudest celebrity you’ve met?": "I wish this question asked which celebrity was the nicest because that would be easy.\n    In a former career, I worked in a variety of post-production roles at a Hollywood movie studio \n    where I met and worked with several celebrities.\n    So before I tell you the rudest, let me tell you a few highlights of some of the nicest.",
    "Does the universe work physically?": "To my limited understanding and knowledge yes. I think the universe supports itself. \n    Not everything is known about even simple phenomenon but how the world functions\n    in general is not some grand mystery. \n    We in general can see a pattern to how moat things work to where we can say it's not magic \n    there is a logical explanation to something."
}