{
  "I have competing offers from startups with 190k base and ~400k equity - all vesting over four years.Does anyone have an explanation?": 
  [
    "I have worked at Google (Mountain View) for 4 years. I started at T4 (and remain at T4 still despite great performance reviews — promotion is non-trivial!) My initial offer had more stock, and Google’s stock price has done very well since the initial grant was made. I automatically sell my stock as soon as it vests. My approximate total annual income has been:",
    "My income in years 3 and 4 was (I think) higher than typical for T4 due to the strength of the stock price. In year 5, unfortunately, I will see a whopping 65k reduction in gross income, so I’ll be back to my year 3 salary, because the annual extra stock grants haven’t been keeping up with the size of the initial stock grant, and because I haven’t been promoted. Promotion seems required to maintain a level salary from year 4 to year 5.",
    "The reason it looks too low is because your source of data looks too high, at least based on what I know. I was just looking at Paysa this morning.On the bright side, I think it’s an interesting site with a lot of potential. On the down side, for the companies I know anything about (which includes Google), it looks like they’re quoting compensation well above the mid-line, at least for the levels I know about. offer sounds alright to me, though the stock is a bit low."
  ],
  "What's a meaningful resolution I can make (and actually keep) for 2020?":
  [
    "You've likely made a resolution in the past that turned out... well,let's just say it didn't turn out so well. 😞Not this year!My recommendation? Resolve to take back control of your personal data online.Most people believe that control of their personal data is broken, but don't know what to do to fix it, or worse, think they can’t do anything to fix it.I’m here to tell you that you can achieve this meaningful resolution through a few quick steps,each of which make a huge difference protecting your privacy:from stopping big tech from sucking up all your browsing data, to adding extra protection to your passwords and email. And, once set up, unlike going to the gym or mastering a new skill, it doesn’t take much effort to maintain. So, let’s make 2020 the year we take back our online privacy!",
    "Step 1. Update your software Software on devices like phones, tablets and computers gets out-of-date over time,and old software can contain security bugs or settings that leak personal data.To reduce your exposure to these privacy risks, check for updates to your apps and operating systems, and even better, set them to update automatically.That way you'll always have the latest, safest versions.",
    "Step 2. Update your privacy settings Now that you have the latest software, dig into the latest privacy settings and update them. Here are step-by-step instructions for all the major device types.Make sure you also go in and adjust per-app location settings,so that your location history isn’t leaking where it shouldn’t.For bonus points, review the apps you have installed. If there are any you haven't used for a while, remove them to reduce the chance of your personal data being shared."
  ],
  "Who are some people that simply don't deserve the fame they have/had?":
  [
    "Well, there’s the fact that she dated someone who was 17 when she was 14. Then the fact that she photo shops all her pictures that she uploads online. Oh, and there’s this controversy with her actual age, because some people have proof that she could be lying about her age. She claims to be 15 now, but some people are saying there’s evidence that proves she’s actually 13 years old. Feel free to look that up, if you wish.",
    "Recently, she has claimed to have gotten pregnant with her boyfriend Mikey Tua. Whether she’s telling the truth, I don’t know. To me, it seems like a big publicity stunt. Maybe in a couple months, she’ll be coming out with news that she had a miscarriage. This could be her way of covering up the fact that she wasn’t actually pregnant in the first place."
  ],
  "What is a brain teaser that is very short and extremely hard for adults?":
  [
    "I was asked this question during an interview. Some of you might have heard a slight variation of it. There are 8 non-reactive chemicals out of which one is poisonous. You have three lab rats to test them on. The poison takes 10 mins to work. How will you find out which is the poisonous chemical in the least possible time?",
    "We feed the rats the chemicals according to the above table. So, the first rat is given Chemicals 5,6,7,8 while the second rat is fed Chemicals 3,4,7,8 and the final rat is given Chemicals 2,4,6,8. After 10 minutes, according to the table, if the 3rd rat dies, Chemical 2 is poisoned. If both the 1st and the 3rd rats die, the poisonous chemical is number 6. And so on. If no rat dies, its Chemical 1!"
  ]
}